WELCOME = (
    "Добро пожаловать в бот обмена сменами!\n"
    "Добавляйте свои смены, просматривайте доступные и предлагайте обмен.\n"
    "Используйте кнопки ниже для управления ботом."
)
SELECT_DATE = "Выберите дату:"
ENTER_TIME = "Введите время в формате: 08:00 - 17:00"
NO_SHIFTS = "Нет доступных смен."
MY_NO_SHIFTS = "У вас нет смен."
SHIFT_SAVED = "Смена сохранена"
CHOOSE_SHIFT_DELETE = "Выберите смену для удаления:"
OFFER_SENT = "Предложение отправлено владельцу смены."
CHOOSE_MY_SHIFT = "Выберите свою смену для обмена:"
NO_MY_SHIFT_ON_DATE = (
    "У тебя нет смен на эту дату для обмена.\n"
    "Введи смену в формате: 08:00 - 17:00"
)
TIME_FORMAT_ERROR = "Неверный формат времени. Используйте '08:00 - 17:00'"
EXCHANGE_CONFIRMED = (
    "✅ Обмен подтверждён!\n"
    "Свяжитесь с WFM и подтвердите смену.\n"
    "Вы обменялись сменами с {user}."
)
